{"type":"data","nodes":[null,{"type":"data","data":[{"lines":1,"name":25},[2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],"\u003Cp>@5\u003C/p>","\u003Ch1>0: I think it&#39;s time to change a few stuff in mayuri.\u003C/h1>","\u003Ch1>1: Is it regarding the interface?\u003C/h1>","\u003Ch1>0: Yeah.\u003C/h1>","\u003Ch1>1: I understand, you&#39;ve been ranting about it since the beginning.\u003C/h1>","\u003Ch1>0: Yeah, I never really liked the design, it felt hacky.\u003C/h1>","\u003Ch1>0: Apart from that, from technical standpoint, the state management in this approach is really limiting.\u003C/h1>","\u003Ch1>1: I am assuming you&#39;re going to switch to traits based approach now?\u003C/h1>","\u003Ch1>0: Yes.\u003C/h1>","\u003Ch1>1: It has its own issues too you know?\u003C/h1>","\u003Ch1>1: I remember you talking about how this approach introduces alot of branching in the handler for redirection of data.\u003C/h1>","\u003Ch1>0: Yeah precisely why I didn&#39;t switch to it earlier.\u003C/h1>","\u003Ch1>1: So why now?\u003C/h1>","\u003Ch1>0: The argument still stands but I don&#39;t think it&#39;s that big of a matter as I was thinking initially.\u003C/h1>","\u003Ch1>0: I soon realised that my field of vision was pretty narrow, what i was building was more of a design meant for command handlers, not general purpose communication libraries.\u003C/h1>","\u003Ch1>0: The truth is, generally speaking, nobody expects command handling from libs meant for communication.\u003C/h1>","\u003Ch1>1: So, what are you gonna do about it? You&#39;re basically deligating the work to users of your lib.\u003C/h1>","\u003Ch1>0: This is far out of scope for such a thing.\u003C/h1>","\u003Ch1>0: Not everyone have a use for command handlers.\u003C/h1>","\u003Ch1>0: Hell my implementation wasnt a pure command handler too, it had a dispatcher which would broadcast content to multiple handlers.\u003C/h1>","\u003Ch1>1: You know what, it does make sense. This way users can freely broadcast and handle events.\u003C/h1>","\u003Ch1>0: Yep!\u003C/h1>","","Mayuri.md"],"uses":{"params":["slug"]}}]}
